7767517
213 230
Input            images                   0 1 images
Convolution      552                      1 1 images 552 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
ReLU             553                      1 1 552 553 0=1.000000e-01
ConvolutionDepthWise 554                      1 1 553 554 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        555                      1 1 554 555 0=32
Clip             558                      1 1 555 558 0=0.000000e+00 1=6.000000e+00
Convolution      559                      1 1 558 559 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        560                      1 1 559 560 0=16
Convolution      561                      1 1 560 561 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        562                      1 1 561 562 0=96
Clip             565                      1 1 562 565 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 566                      1 1 565 566 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        567                      1 1 566 567 0=96
Clip             570                      1 1 567 570 0=0.000000e+00 1=6.000000e+00
Convolution      571                      1 1 570 571 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        572                      1 1 571 572 0=24
Split            splitncnn_0              1 2 572 572_splitncnn_0 572_splitncnn_1
Convolution      573                      1 1 572_splitncnn_1 573 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        574                      1 1 573 574 0=144
Clip             577                      1 1 574 577 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 578                      1 1 577 578 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        579                      1 1 578 579 0=144
Clip             582                      1 1 579 582 0=0.000000e+00 1=6.000000e+00
Convolution      583                      1 1 582 583 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        584                      1 1 583 584 0=24
BinaryOp         585                      2 1 572_splitncnn_0 584 585 0=0
Convolution      586                      1 1 585 586 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        587                      1 1 586 587 0=144
Clip             590                      1 1 587 590 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 591                      1 1 590 591 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        592                      1 1 591 592 0=144
Clip             595                      1 1 592 595 0=0.000000e+00 1=6.000000e+00
Convolution      596                      1 1 595 596 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        597                      1 1 596 597 0=32
Split            splitncnn_1              1 2 597 597_splitncnn_0 597_splitncnn_1
Convolution      598                      1 1 597_splitncnn_1 598 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        599                      1 1 598 599 0=192
Clip             602                      1 1 599 602 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 603                      1 1 602 603 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        604                      1 1 603 604 0=192
Clip             607                      1 1 604 607 0=0.000000e+00 1=6.000000e+00
Convolution      608                      1 1 607 608 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        609                      1 1 608 609 0=32
BinaryOp         610                      2 1 597_splitncnn_0 609 610 0=0
Split            splitncnn_2              1 2 610 610_splitncnn_0 610_splitncnn_1
Convolution      611                      1 1 610_splitncnn_1 611 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        612                      1 1 611 612 0=192
Clip             615                      1 1 612 615 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 616                      1 1 615 616 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        617                      1 1 616 617 0=192
Clip             620                      1 1 617 620 0=0.000000e+00 1=6.000000e+00
Convolution      621                      1 1 620 621 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        622                      1 1 621 622 0=32
BinaryOp         623                      2 1 610_splitncnn_0 622 623 0=0
Split            splitncnn_3              1 2 623 623_splitncnn_0 623_splitncnn_1
Convolution      624                      1 1 623_splitncnn_1 624 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        625                      1 1 624 625 0=192
Clip             628                      1 1 625 628 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 629                      1 1 628 629 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        630                      1 1 629 630 0=192
Clip             633                      1 1 630 633 0=0.000000e+00 1=6.000000e+00
Convolution      634                      1 1 633 634 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        635                      1 1 634 635 0=64
Split            splitncnn_4              1 2 635 635_splitncnn_0 635_splitncnn_1
Convolution      636                      1 1 635_splitncnn_1 636 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        637                      1 1 636 637 0=384
Clip             640                      1 1 637 640 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 641                      1 1 640 641 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        642                      1 1 641 642 0=384
Clip             645                      1 1 642 645 0=0.000000e+00 1=6.000000e+00
Convolution      646                      1 1 645 646 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        647                      1 1 646 647 0=64
BinaryOp         648                      2 1 635_splitncnn_0 647 648 0=0
Split            splitncnn_5              1 2 648 648_splitncnn_0 648_splitncnn_1
Convolution      649                      1 1 648_splitncnn_1 649 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        650                      1 1 649 650 0=384
Clip             653                      1 1 650 653 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 654                      1 1 653 654 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        655                      1 1 654 655 0=384
Clip             658                      1 1 655 658 0=0.000000e+00 1=6.000000e+00
Convolution      659                      1 1 658 659 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        660                      1 1 659 660 0=64
BinaryOp         661                      2 1 648_splitncnn_0 660 661 0=0
Split            splitncnn_6              1 2 661 661_splitncnn_0 661_splitncnn_1
Convolution      662                      1 1 661_splitncnn_1 662 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        663                      1 1 662 663 0=384
Clip             666                      1 1 663 666 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 667                      1 1 666 667 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        668                      1 1 667 668 0=384
Clip             671                      1 1 668 671 0=0.000000e+00 1=6.000000e+00
Convolution      672                      1 1 671 672 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        673                      1 1 672 673 0=64
BinaryOp         674                      2 1 661_splitncnn_0 673 674 0=0
Convolution      675                      1 1 674 675 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        676                      1 1 675 676 0=384
Clip             679                      1 1 676 679 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 680                      1 1 679 680 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        681                      1 1 680 681 0=384
Clip             684                      1 1 681 684 0=0.000000e+00 1=6.000000e+00
Convolution      685                      1 1 684 685 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        686                      1 1 685 686 0=96
Split            splitncnn_7              1 2 686 686_splitncnn_0 686_splitncnn_1
Convolution      687                      1 1 686_splitncnn_1 687 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        688                      1 1 687 688 0=576
Clip             691                      1 1 688 691 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 692                      1 1 691 692 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        693                      1 1 692 693 0=576
Clip             696                      1 1 693 696 0=0.000000e+00 1=6.000000e+00
Convolution      697                      1 1 696 697 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        698                      1 1 697 698 0=96
BinaryOp         699                      2 1 686_splitncnn_0 698 699 0=0
Split            splitncnn_8              1 2 699 699_splitncnn_0 699_splitncnn_1
Convolution      700                      1 1 699_splitncnn_1 700 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        701                      1 1 700 701 0=576
Clip             704                      1 1 701 704 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 705                      1 1 704 705 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        706                      1 1 705 706 0=576
Clip             709                      1 1 706 709 0=0.000000e+00 1=6.000000e+00
Convolution      710                      1 1 709 710 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        711                      1 1 710 711 0=96
BinaryOp         712                      2 1 699_splitncnn_0 711 712 0=0
Split            splitncnn_9              1 2 712 712_splitncnn_0 712_splitncnn_1
Convolution      713                      1 1 712_splitncnn_1 713 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        714                      1 1 713 714 0=576
Clip             717                      1 1 714 717 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 718                      1 1 717 718 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        719                      1 1 718 719 0=576
Clip             722                      1 1 719 722 0=0.000000e+00 1=6.000000e+00
Convolution      723                      1 1 722 723 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        724                      1 1 723 724 0=160
Split            splitncnn_10             1 2 724 724_splitncnn_0 724_splitncnn_1
Convolution      725                      1 1 724_splitncnn_1 725 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        726                      1 1 725 726 0=960
Clip             729                      1 1 726 729 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 730                      1 1 729 730 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        731                      1 1 730 731 0=960
Clip             734                      1 1 731 734 0=0.000000e+00 1=6.000000e+00
Convolution      735                      1 1 734 735 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        736                      1 1 735 736 0=160
BinaryOp         737                      2 1 724_splitncnn_0 736 737 0=0
Split            splitncnn_11             1 2 737 737_splitncnn_0 737_splitncnn_1
Convolution      738                      1 1 737_splitncnn_1 738 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        739                      1 1 738 739 0=960
Clip             742                      1 1 739 742 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 743                      1 1 742 743 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        744                      1 1 743 744 0=960
Clip             747                      1 1 744 747 0=0.000000e+00 1=6.000000e+00
Convolution      748                      1 1 747 748 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        749                      1 1 748 749 0=160
BinaryOp         750                      2 1 737_splitncnn_0 749 750 0=0
Convolution      751                      1 1 750 751 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        752                      1 1 751 752 0=960
Clip             755                      1 1 752 755 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 756                      1 1 755 756 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        757                      1 1 756 757 0=960
Clip             760                      1 1 757 760 0=0.000000e+00 1=6.000000e+00
Convolution      761                      1 1 760 761 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        762                      1 1 761 762 0=320
Split            splitncnn_12             1 2 762 762_splitncnn_0 762_splitncnn_1
Convolution      763                      1 1 762_splitncnn_1 763 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=81920
ReLU             764                      1 1 763 764 0=1.000000e-01
Convolution      765                      1 1 764 765 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             766                      1 1 765 766 0=1.000000e-01
Convolution      767                      1 1 766 767 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             768                      1 1 767 768 0=1.000000e-01
Convolution      769                      1 1 768 769 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
Convolution      770                      1 1 762_splitncnn_0 770 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=81920
Concat           771                      2 1 769 770 771 0=0
BatchNorm        772                      1 1 771 772 0=512
ReLU             773                      1 1 772 773 0=1.000000e-01
Convolution      774                      1 1 773 774 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             775                      1 1 774 775 0=1.000000e-01
Split            splitncnn_13             1 2 775 775_splitncnn_0 775_splitncnn_1
Convolution      776                      1 1 775_splitncnn_1 776 0=75 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
Interp           804                      1 1 775_splitncnn_0 804 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0
Concat           805                      2 1 804 712_splitncnn_0 805 0=0
Convolution      806                      1 1 805 806 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=155648
ReLU             807                      1 1 806 807 0=1.000000e-01
Split            splitncnn_14             1 2 807 807_splitncnn_0 807_splitncnn_1
Convolution      808                      1 1 807_splitncnn_1 808 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             809                      1 1 808 809 0=1.000000e-01
Convolution      810                      1 1 809 810 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             811                      1 1 810 811 0=1.000000e-01
Convolution      812                      1 1 811 812 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             813                      1 1 812 813 0=1.000000e-01
Convolution      814                      1 1 813 814 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      815                      1 1 807_splitncnn_0 815 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
Concat           816                      2 1 814 815 816 0=0
BatchNorm        817                      1 1 816 817 0=256
ReLU             818                      1 1 817 818 0=1.000000e-01
Convolution      819                      1 1 818 819 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             820                      1 1 819 820 0=1.000000e-01
Split            splitncnn_15             1 2 820 820_splitncnn_0 820_splitncnn_1
Convolution      821                      1 1 820_splitncnn_1 821 0=75 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19200
Interp           849                      1 1 820_splitncnn_0 849 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0
Concat           850                      2 1 849 623_splitncnn_0 850 0=0
Convolution      851                      1 1 850 851 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
ReLU             852                      1 1 851 852 0=1.000000e-01
Split            splitncnn_16             1 2 852 852_splitncnn_0 852_splitncnn_1
Convolution      853                      1 1 852_splitncnn_1 853 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             854                      1 1 853 854 0=1.000000e-01
Convolution      855                      1 1 854 855 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             856                      1 1 855 856 0=1.000000e-01
Convolution      857                      1 1 856 857 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             858                      1 1 857 858 0=1.000000e-01
Convolution      859                      1 1 858 859 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Convolution      860                      1 1 852_splitncnn_0 860 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
Concat           861                      2 1 859 860 861 0=0
BatchNorm        862                      1 1 861 862 0=128
ReLU             863                      1 1 862 863 0=1.000000e-01
Convolution      864                      1 1 863 864 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             865                      1 1 864 865 0=1.000000e-01
Convolution      output                   1 1 865 output 0=75 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
