7767517
185 201
Input            input0                   0 1 input0
Convolution      301                      1 1 input0 301 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216
BatchNorm        302                      1 1 301 302 0=8
ReLU             303                      1 1 302 303 0=1.000000e-01
ConvolutionDepthWise 304                      1 1 303 304 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=72 7=8
BatchNorm        305                      1 1 304 305 0=8
ReLU             306                      1 1 305 306 0=1.000000e-01
Convolution      307                      1 1 306 307 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        308                      1 1 307 308 0=16
ReLU             309                      1 1 308 309 0=1.000000e-01
ConvolutionDepthWise 310                      1 1 309 310 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        311                      1 1 310 311 0=16
ReLU             312                      1 1 311 312 0=1.000000e-01
Convolution      313                      1 1 312 313 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        314                      1 1 313 314 0=32
ReLU             315                      1 1 314 315 0=1.000000e-01
ConvolutionDepthWise 316                      1 1 315 316 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        317                      1 1 316 317 0=32
ReLU             318                      1 1 317 318 0=1.000000e-01
Convolution      319                      1 1 318 319 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        320                      1 1 319 320 0=32
ReLU             321                      1 1 320 321 0=1.000000e-01
ConvolutionDepthWise 322                      1 1 321 322 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        323                      1 1 322 323 0=32
ReLU             324                      1 1 323 324 0=1.000000e-01
Convolution      325                      1 1 324 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        326                      1 1 325 326 0=64
ReLU             327                      1 1 326 327 0=1.000000e-01
ConvolutionDepthWise 328                      1 1 327 328 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        329                      1 1 328 329 0=64
ReLU             330                      1 1 329 330 0=1.000000e-01
Convolution      331                      1 1 330 331 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        332                      1 1 331 332 0=64
ReLU             333                      1 1 332 333 0=1.000000e-01
Split            splitncnn_0              1 2 333 333_splitncnn_0 333_splitncnn_1
ConvolutionDepthWise 334                      1 1 333_splitncnn_1 334 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        335                      1 1 334 335 0=64
ReLU             336                      1 1 335 336 0=1.000000e-01
Convolution      337                      1 1 336 337 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        338                      1 1 337 338 0=128
ReLU             339                      1 1 338 339 0=1.000000e-01
ConvolutionDepthWise 340                      1 1 339 340 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        341                      1 1 340 341 0=128
ReLU             342                      1 1 341 342 0=1.000000e-01
Convolution      343                      1 1 342 343 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        344                      1 1 343 344 0=128
ReLU             345                      1 1 344 345 0=1.000000e-01
ConvolutionDepthWise 346                      1 1 345 346 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        347                      1 1 346 347 0=128
ReLU             348                      1 1 347 348 0=1.000000e-01
Convolution      349                      1 1 348 349 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        350                      1 1 349 350 0=128
ReLU             351                      1 1 350 351 0=1.000000e-01
ConvolutionDepthWise 352                      1 1 351 352 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        353                      1 1 352 353 0=128
ReLU             354                      1 1 353 354 0=1.000000e-01
Convolution      355                      1 1 354 355 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        356                      1 1 355 356 0=128
ReLU             357                      1 1 356 357 0=1.000000e-01
ConvolutionDepthWise 358                      1 1 357 358 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        359                      1 1 358 359 0=128
ReLU             360                      1 1 359 360 0=1.000000e-01
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        362                      1 1 361 362 0=128
ReLU             363                      1 1 362 363 0=1.000000e-01
ConvolutionDepthWise 364                      1 1 363 364 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        365                      1 1 364 365 0=128
ReLU             366                      1 1 365 366 0=1.000000e-01
Convolution      367                      1 1 366 367 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        368                      1 1 367 368 0=128
ReLU             369                      1 1 368 369 0=1.000000e-01
Split            splitncnn_1              1 2 369 369_splitncnn_0 369_splitncnn_1
ConvolutionDepthWise 370                      1 1 369_splitncnn_1 370 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        371                      1 1 370 371 0=128
ReLU             372                      1 1 371 372 0=1.000000e-01
Convolution      373                      1 1 372 373 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        374                      1 1 373 374 0=256
ReLU             375                      1 1 374 375 0=1.000000e-01
ConvolutionDepthWise 376                      1 1 375 376 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        377                      1 1 376 377 0=256
ReLU             378                      1 1 377 378 0=1.000000e-01
Convolution      379                      1 1 378 379 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        380                      1 1 379 380 0=256
ReLU             381                      1 1 380 381 0=1.000000e-01
Convolution      382                      1 1 333_splitncnn_0 382 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        383                      1 1 382 383 0=64
ReLU             384                      1 1 383 384 0=1.000000e-01
Convolution      385                      1 1 369_splitncnn_0 385 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        386                      1 1 385 386 0=64
ReLU             387                      1 1 386 387 0=1.000000e-01
Convolution      388                      1 1 381 388 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        389                      1 1 388 389 0=64
ReLU             390                      1 1 389 390 0=1.000000e-01
Split            splitncnn_2              1 3 390 390_splitncnn_0 390_splitncnn_1 390_splitncnn_2
Interp           408                      1 1 390_splitncnn_2 408 0=1 1=1.000000e+00 2=1.000000e+00 3=40 4=40
BinaryOp         409                      2 1 387 408 409 0=0
Convolution      410                      1 1 409 410 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        411                      1 1 410 411 0=64
ReLU             412                      1 1 411 412 0=1.000000e-01
Split            splitncnn_3              1 3 412 412_splitncnn_0 412_splitncnn_1 412_splitncnn_2
Interp           430                      1 1 412_splitncnn_2 430 0=1 1=1.000000e+00 2=1.000000e+00 3=80 4=80
BinaryOp         431                      2 1 384 430 431 0=0
Convolution      432                      1 1 431 432 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        433                      1 1 432 433 0=64
ReLU             434                      1 1 433 434 0=1.000000e-01
Split            splitncnn_4              1 2 434 434_splitncnn_0 434_splitncnn_1
Convolution      435                      1 1 434_splitncnn_1 435 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        436                      1 1 435 436 0=32
Convolution      437                      1 1 434_splitncnn_0 437 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        438                      1 1 437 438 0=16
ReLU             439                      1 1 438 439 0=1.000000e-01
Split            splitncnn_5              1 2 439 439_splitncnn_0 439_splitncnn_1
Convolution      440                      1 1 439_splitncnn_1 440 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        441                      1 1 440 441 0=16
Convolution      442                      1 1 439_splitncnn_0 442 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        443                      1 1 442 443 0=16
ReLU             444                      1 1 443 444 0=1.000000e-01
Convolution      445                      1 1 444 445 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        446                      1 1 445 446 0=16
Concat           447                      3 1 436 441 446 447 0=0
ReLU             448                      1 1 447 448
Split            splitncnn_6              1 3 448 448_splitncnn_0 448_splitncnn_1 448_splitncnn_2
Convolution      449                      1 1 412_splitncnn_1 449 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        450                      1 1 449 450 0=32
Convolution      451                      1 1 412_splitncnn_0 451 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        452                      1 1 451 452 0=16
ReLU             453                      1 1 452 453 0=1.000000e-01
Split            splitncnn_7              1 2 453 453_splitncnn_0 453_splitncnn_1
Convolution      454                      1 1 453_splitncnn_1 454 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        455                      1 1 454 455 0=16
Convolution      456                      1 1 453_splitncnn_0 456 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        457                      1 1 456 457 0=16
ReLU             458                      1 1 457 458 0=1.000000e-01
Convolution      459                      1 1 458 459 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        460                      1 1 459 460 0=16
Concat           461                      3 1 450 455 460 461 0=0
ReLU             462                      1 1 461 462
Split            splitncnn_8              1 3 462 462_splitncnn_0 462_splitncnn_1 462_splitncnn_2
Convolution      463                      1 1 390_splitncnn_1 463 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        464                      1 1 463 464 0=32
Convolution      465                      1 1 390_splitncnn_0 465 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        466                      1 1 465 466 0=16
ReLU             467                      1 1 466 467 0=1.000000e-01
Split            splitncnn_9              1 2 467 467_splitncnn_0 467_splitncnn_1
Convolution      468                      1 1 467_splitncnn_1 468 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        469                      1 1 468 469 0=16
Convolution      470                      1 1 467_splitncnn_0 470 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        471                      1 1 470 471 0=16
ReLU             472                      1 1 471 472 0=1.000000e-01
Convolution      473                      1 1 472 473 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        474                      1 1 473 474 0=16
Concat           475                      3 1 464 469 474 475 0=0
ReLU             476                      1 1 475 476
Split            splitncnn_10             1 3 476 476_splitncnn_0 476_splitncnn_1 476_splitncnn_2
Convolution      477                      1 1 448_splitncnn_2 477 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          478                      1 1 477 478 0=3
Reshape          488                      1 1 478 488 0=4 1=-1
Convolution      489                      1 1 462_splitncnn_2 489 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          490                      1 1 489 490 0=3
Reshape          500                      1 1 490 500 0=4 1=-1
Convolution      501                      1 1 476_splitncnn_2 501 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          502                      1 1 501 502 0=3
Reshape          512                      1 1 502 512 0=4 1=-1
Concat           output0                  3 1 488 500 512 output0 0=0
Convolution      514                      1 1 448_splitncnn_1 514 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          515                      1 1 514 515 0=3
Reshape          525                      1 1 515 525 0=2 1=-1
Convolution      526                      1 1 462_splitncnn_1 526 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          527                      1 1 526 527 0=3
Reshape          537                      1 1 527 537 0=2 1=-1
Convolution      538                      1 1 476_splitncnn_1 538 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          539                      1 1 538 539 0=3
Reshape          549                      1 1 539 549 0=2 1=-1
Concat           550                      3 1 525 537 549 550 0=0
Convolution      551                      1 1 448_splitncnn_0 551 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          552                      1 1 551 552 0=3
Reshape          562                      1 1 552 562 0=10 1=-1
Convolution      563                      1 1 462_splitncnn_0 563 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          564                      1 1 563 564 0=3
Reshape          574                      1 1 564 574 0=10 1=-1
Convolution      575                      1 1 476_splitncnn_0 575 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          576                      1 1 575 576 0=3
Reshape          586                      1 1 576 586 0=10 1=-1
Concat           587                      3 1 562 574 586 587 0=0
Softmax          588                      1 1 550 588 0=1 1=1
